# RoomLightLossFactorWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..IlluminationFailures..::..RoomLightLossFactorWarning Property
BuiltInFailures..::..IlluminationFailures Class See Also
---
Estimated Illumination failed. Light Loss factor not set for lighting fixture.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomLightLossFactorWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomLightLossFactorWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomLightLossFactorWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..IlluminationFailures Class
Autodesk.Revit.DB Namespace